#DAY 4

Pandas 
Creating Data Frame

In [71]:
## Creating data frame 
import pandas as pd 
sample_data_frame = {'student_name':['Ali','Ahmed','Farah'],'Age':[20,40,30]}
data = pd.DataFrame(data = sample_data_frame , columns=['student_name','Age'])
data.head()

  student_name  Age
0          Ali   20
1        Ahmed   40
2        Farah   30

In [73]:
##Reading data from CSVs
data  = pd.read_csv("Mall_Customers.csv")
data.head()

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [74]:
## Reading data using online link 
import pandas as pd
url="https://raw.githubusercontent.com/cs109/2014_data/master/countries.csv"
c=pd.read_csv(url)
c.head()

    Country  Region
0   Algeria  AFRICA
1    Angola  AFRICA
2     Benin  AFRICA
3  Botswana  AFRICA
4   Burkina  AFRICA

The read_csv() method isn't limited to only reading local files. You can also read CSV files located on remote servers. 
Let's read and print out the head of the Countries Dataset

In [75]:
## Reading data from json format 
data = pd.read_json("employee.json")
data.head()

            name   age   income gender  department grade
0    Allen Smith  45.0      NaN   None  Operations    G3
1        S Kumar   NaN  16000.0      F     Finance    G0
2    Jack Morgan  32.0  35000.0      M     Finance    G2
3      Ying Chin  45.0  65000.0      F       Sales    G3
4  Dheeraj Patel  30.0  42000.0      F  Operations    G2

If you have a JSON ((JavaScript Object Notation) files — which is essentially a stored Python dict  pandas offers the read_json function for reading JSON data and
to_json() for writing JSON data

In [76]:
##Reading excel files using pandas library 
data_weather= pd.read_excel('weather.xlsx')
data_weather.head()

   MinTemp  MaxTemp  Rainfall  ...  RainToday  RISK_MM RainTomorrow
0      8.0     24.3       0.0  ...         No      3.6          Yes
1     14.0     26.9       3.6  ...        Yes      3.6          Yes
2     13.7     23.4       3.6  ...        Yes     39.8          Yes
3     13.3     15.5      39.8  ...        Yes      2.8          Yes
4      7.6     16.1       2.8  ...        Yes      0.0           No

[5 rows x 22 columns]

We can use the pandas module read_excel() function to read the excel file data into a DataFrame object

In [15]:
## Checking column list of our data frame  
print("List of Columns:", data.columns)

List of Columns: Index(['name', 'age', 'income', 'gender', 'department', 'grade'], dtype='object')

In [77]:
## Checking data types of DataFrame columns 
print("Data types:", data.dtypes)

Data types: name           object
age           float64
income        float64
gender         object
department     object
grade          object
dtype: object

In [78]:
##Select the specific column(s)
data['income']

0        NaN
1    16000.0
2    35000.0
3    65000.0
4    42000.0
5    62000.0
6        NaN
7    52000.0
8    98000.0
Name: income, dtype: float64

In [ ]:
## Renaming the column
data.rename(columns={'name': 'Employee_name'})

Pandas provide you the simple function(rename) to change the name of a column or set of columns to make the job easy.

In [ ]:
## Grouping  pandas DataFrame
## let's import countires data set 
data__set = pd.read_csv   ("WHO_first9cols.csv")
data__set.head()

In [94]:
# Group By DataFrame on the basis of Continent column
data__set.groupby('Continent').mean()

            CountryID  ...  Population (in thousands) total
Continent              ...
1          110.238095  ...                     16843.350000
2          100.333333  ...                     17259.627451
3           99.354167  ...                     16503.195652
4           56.285714  ...                     73577.333333
5           94.774194  ...                     15637.241379
6          121.228571  ...                     25517.142857
7           80.777778  ...                    317683.666667

[7 rows x 7 columns]

In [95]:
# Group By DataFrame on the basis of continent and select Gross national income per capita (PPP international $)
data__set.groupby('Continent').mean()['Gross national income per capita (PPP international $)']

Continent
1    14893.529412
2    19777.083333
3     3050.434783
4    24524.000000
5     7397.142857
6    12167.200000
7     2865.555556
Name: Gross national income per capita (PPP international $), dtype: float64

In the preceding example, the continent-wise average Gross national income per capita (PPP international $) was
computed. You can also group based on multiple columns by passing a list of columns to
the groupby() function.

In [96]:
## Joints
dest_data = pd.read_csv("dest.csv")
dest_data.head()

   EmpNr       Dest
0      5  The Hague
1      3  Amsterdam
2      9  Rotterdam

In [97]:
## tips 
tips_data = pd.read_csv("tips.csv")
tips_data.head()

   EmpNr  Amount
0      5    10.0
1      9     5.0
2      7     2.5

In [98]:
##Inner join in pandas libary 
data_inner= pd.merge(dest_data, tips_data, on='EmpNr', how='inner')
data_inner.head()

   EmpNr       Dest  Amount
0      5  The Hague    10.0
1      9  Rotterdam     5.0

In [99]:
##Left join in pandas libary 
data_inner= pd.merge(dest_data, tips_data, on='EmpNr', how='left')
data_inner.head()

   EmpNr       Dest  Amount
0      5  The Hague    10.0
1      3  Amsterdam     NaN
2      9  Rotterdam     5.0

In [50]:
##Right join in pandas libary 
data_inner= pd.merge(dest_data, tips_data, on='EmpNr', how='right')
data_inner.head()

   EmpNr       Dest  Amount
0      5  The Hague    10.0
1      9  Rotterdam     5.0
2      7        NaN     2.5

In [100]:
##Outer join in pandas libary 
data_inner= pd.merge(dest_data, tips_data, on='EmpNr', how='outer')
data_inner.head()

   EmpNr       Dest  Amount
0      5  The Hague    10.0
1      3  Amsterdam     NaN
2      9  Rotterdam     5.0
3      7        NaN     2.5

In [ ]:
##pandas working missing values 
null_values = pd.isnull(data_weather).sum()
null_values

In [ ]:
##droping missing values 
# Drop all the missing values
data_weather.dropna(inplace=True)
data_weather.info()

In [ ]:
##Filling the missing values 
data_weather.fillna(0,inplace= True)
data_weather.info()

In [ ]:
data__set.head()

In [92]:
titanic_data = pd.read_csv("train.csv")
table = pd.pivot_table(data=titanic_data,index=['sex'])
table

              age       fare     parch    pclass     sibsp  survived
sex
female  27.915709  44.479818  0.649682  2.159236  0.694268  0.742038
male    30.726645  25.523893  0.235702  2.389948  0.429809  0.188908